IDEA StatiCa Open Model
Member Constructor (MemberType, Int32)
Compatible with IDEA StatiCa Beta 21.0 - beta
 Constructor
 Namespace: IdeaRS.OpenModel.Result
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public Member(
	MemberType memberType,
	int id
)
Public Sub New (
	memberType As MemberType,
	id As Integer
)
public:
Member(
	MemberType memberType,
	int id
)
Parameters
memberType
Type: IdeaRS.OpenModel.Result.MemberType
Type of member
id
Type: System.Int32
Id of member
See Also
Reference
Member Class
Member Overload
IdeaRS.OpenModel.Result Namespace